app/controllers/openings_controller.rb

	def create
		permitedParamsOpenings = giveOpeningsParamsPermission(params)
		@openings = Opening.new(permitedParamsOpenings)
		@openings.save
---
INSERT INTO "openings" ("name", "move_sequence", "user_id", "play_color", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

	def show
		openingArray = []
		openingHash = Opening.where(user_id:params.require(:user_id))
	  	respond_to do |format|
	  		for i in 0..openingHash.length-1
---
SELECT "openings".* FROM "openings" WHERE "openings"."user_id" = ?  [["user_id", 3]]
SELECT "openings".* FROM "openings" WHERE "openings"."user_id" = ?  [["user_id", 1]]

	def importOpeningFile
		@openings = Opening.new(name: getingImportatedOpeningName(params),
								move_sequence: getingImportatedOpeningMoveSequence(params),
								user_id: params.require(:user_id),
								play_color: "0")
		@openings.save
---
INSERT INTO "openings" ("name", "move_sequence", "user_id", "play_color", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)